SELECT ЗАКАЗЫ.[Наименование товара], ЗАКАЗЫ.[Дата поставки]
FROM     ЗАКАЗЧИКИ INNER JOIN
                  ЗАКАЗЫ ON ЗАКАЗЧИКИ.[Наименование фирмы] = ЗАКАЗЫ.Заказчик INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.[Наименование товара] = ТОВАРЫ.Наименование
WHERE  (ЗАКАЗЫ.[Дата поставки] >= CONVERT(DATE, '1213-12-12', 102))
ORDER BY ЗАКАЗЫ.[Дата поставки]



SELECT ТОВАРЫ.Наименование, ТОВАРЫ.Цена
FROM     ЗАКАЗЧИКИ INNER JOIN
                  ЗАКАЗЫ ON ЗАКАЗЧИКИ.[Наименование фирмы] = ЗАКАЗЫ.Заказчик INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.[Наименование товара] = ТОВАРЫ.Наименование
WHERE  (ТОВАРЫ.Цена > 123) AND
                  (ТОВАРЫ.Цена < 5000)
				  
				  
SELECT ЗАКАЗЧИКИ.[Наименование фирмы], ЗАКАЗЫ.[Наименование товара]
FROM     ЗАКАЗЧИКИ INNER JOIN
                  ЗАКАЗЫ ON ЗАКАЗЧИКИ.[Наименование фирмы] = ЗАКАЗЫ.Заказчик INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.[Наименование товара] = ТОВАРЫ.Наименование
WHERE  (ЗАКАЗЫ.[Наименование товара] = N'телефон')


SELECT ЗАКАЗЫ.[Номер заказа], ЗАКАЗЧИКИ.[Наименование фирмы], ЗАКАЗЫ.[Дата поставки]
FROM     ЗАКАЗЧИКИ INNER JOIN
                  ЗАКАЗЫ ON ЗАКАЗЧИКИ.[Наименование фирмы] = ЗАКАЗЫ.Заказчик INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.[Наименование товара] = ТОВАРЫ.Наименование
WHERE  (ЗАКАЗЧИКИ.[Наименование фирмы] = N'БГУ')
ORDER BY ЗАКАЗЫ.[Дата поставки]


create table BOOKS
(
книга varchar(20),
количество int
)